released/M031BSP_ADC_Bandgap_MultiCH_PDMA/SampleCode/Template/main.c
		}	
    }
}

void TIMER1_Init(void)
{
    TIMER_Open(TIMER1, TIMER_PERIODIC_MODE, 1000);
    TIMER_EnableInt(TIMER1);
    NVIC_EnableIRQ(TMR1_IRQn);	
    TIMER_Start(TIMER1);
}


void Sort_tab(uint16_t tab[], uint8_t length)
{
	uint8_t l = 0x00, exchange = 0x01; 
	uint16_t tmp = 0x00;

	/* Sort tab */
	while(exchange==1) 
	{ 
		exchange=0; 
		for(l=0; l<length-1; l++) 
		{
			if( tab[l] > tab[l+1] ) 
			{ 
				tmp = tab[l]; 
				tab[l] = tab[l+1]; 
				tab[l+1] = tmp; 
				exchange=1; 
			}
		}
	} 
}

uint16_t Filter_MovingAverage(uint8_t state)
{
	volatile uint32_t sum = 0;
	uint16_t tmp = 0;
	uint16_t i = 0;
	static uint16_t res = 0;

	switch(state)
	{
		case State_average:	
        
            printf("moving average initial\r\n");

            for ( i = 0 ; i < ADC_SAMPLE_COUNT ; i++)
            {					
                /* Delay for band-gap voltage stability */
                CLK_SysTickDelay(100);

                /* Start A/D conversion */
                ADC_START_CONV(ADC);

                tmp = 0;

                /* Wait conversion done */
                while(!ADC_GET_INT_FLAG(ADC, ADC_ADF_INT));

                /* Clear the A/D interrupt flag for safe */
                ADC_CLR_INT_FLAG(ADC, ADC_ADF_INT);

                tmp = ADC_GET_CONVERSION_DATA(ADC, 29);
                sum += tmp;
            }
            res = (uint16_t) (sum >> ADC_SAMPLE_POWER);			//do average

			break;

		case State_moving:

            /* Delay for band-gap voltage stability */
            CLK_SysTickDelay(100);

            /* Start A/D conversion */
            ADC_START_CONV(ADC);

            tmp = 0;

            /* Wait conversion done */
            while(!ADC_GET_INT_FLAG(ADC, ADC_ADF_INT));

            /* Clear the A/D interrupt flag for safe */
            ADC_CLR_INT_FLAG(ADC, ADC_ADF_INT);

            tmp = ADC_GET_CONVERSION_DATA(ADC, 29);

            sum = res << ADC_SAMPLE_POWER;						//extend the original average data
            sum -= res;										    //subtract the old average data
            sum += tmp;								            //add the new adc data
            res = (uint16_t) (sum >> ADC_SAMPLE_POWER);			//do average again
        
			break;		
	}

    return res;	
}

void ReloadPDMA(void)
{
    reset_buffer((void*)g_iConversionData, 0x00, sizeof(g_iConversionData));

    /* transfer width is half word(16 bit) and transfer count is ADCDatalength+1 */
    PDMA_SetTransferCnt(PDMA, ADC_DMA_CH, PDMA_WIDTH_16, ADCTotalLength);

    /* Set source address as ADC data register (no increment) and destination address as g_iConversionData array (increment) */
    PDMA_SetTransferAddr(PDMA, ADC_DMA_CH, (uint32_t)&ADC->ADPDMA, PDMA_SAR_FIX, (uint32_t)g_iConversionData, PDMA_DAR_INC);

    /* Select PDMA request source as ADC RX */
    PDMA_SetTransferMode(PDMA, ADC_DMA_CH, PDMA_ADC_RX, FALSE, 0);
}

void PDMA_IRQHandler(void)
{
    uint32_t status = PDMA_GET_INT_STATUS(PDMA);
	
    if (status & PDMA_INTSTS_ABTIF_Msk)   /* abort */
    {
		#if 1
        PDMA_CLR_ABORT_FLAG(PDMA, PDMA_GET_ABORT_STS(PDMA));
		#else
        if (PDMA_GET_ABORT_STS(PDMA) & (1 << ADC_DMA_CH))
        {
        }
        PDMA_CLR_ABORT_FLAG(, (1 << ADC_DMA_CH));
        if (PDMA_GET_ABORT_STS(PDMA) & (1 << SPI_MASTER_RX_DMA_CH))
        {
        }
        PDMA_CLR_ABORT_FLAG(, (1 << SPI_MASTER_RX_DMA_CH));
		#endif
    }
    else if (status & PDMA_INTSTS_TDIF_Msk)     /* done */
    {
        if((PDMA_GET_TD_STS(PDMA) & ADC_DMA_OPENED_CH) == ADC_DMA_OPENED_CH)
        {
            /* Clear PDMA transfer done interrupt flag */
            PDMA_CLR_TD_FLAG(PDMA, ADC_DMA_OPENED_CH);

            FLAG_PROJ_PDMA_ADC = 1;       
        } 

    }
    else if (status & (PDMA_INTSTS_REQTOF0_Msk | PDMA_INTSTS_REQTOF1_Msk))     /* Check the DMA time-out interrupt flag */
    {
        PDMA_CLR_TMOUT_FLAG(PDMA,ADC_DMA_CH);     
    }
    else
    {

    }	
}

void PDMA_DeInit(void)
{
    PDMA_DisableInt(PDMA, ADC_DMA_CH, PDMA_INT_TRANS_DONE);
    NVIC_DisableIRQ(PDMA_IRQn);
}

void PDMA_Init(void)
{
    /* Configure PDMA peripheral mode form ADC to memory */
    /* Open PDMA Channel 4 based on ADC_DMA_CH setting*/
    PDMA_Open(PDMA, ADC_DMA_OPENED_CH);

    /* transfer width is half word(16 bit) and transfer count is ADCDatalength+1 */
    PDMA_SetTransferCnt(PDMA, ADC_DMA_CH, PDMA_WIDTH_16, ADCTotalLength);

    /* Set source address as ADC data register (no increment) and destination address as g_iConversionData array (increment) */
    PDMA_SetTransferAddr(PDMA, ADC_DMA_CH, (uint32_t)&ADC->ADPDMA, PDMA_SAR_FIX, (uint32_t)g_iConversionData, PDMA_DAR_INC);

    /* Select PDMA request source as ADC RX */
    PDMA_SetTransferMode(PDMA, ADC_DMA_CH, PDMA_ADC_RX, FALSE, 0);

    /* Set PDMA as single request type for ADC */
    PDMA_SetBurstType(PDMA, ADC_DMA_CH, PDMA_REQ_SINGLE, 0);

    PDMA_EnableInt(PDMA, ADC_DMA_CH, PDMA_INT_TRANS_DONE);
    NVIC_EnableIRQ(PDMA_IRQn);

    // ADC_POWER_ON(ADC);
    // CLK_SysTickDelay(10000);

}

__STATIC_INLINE uint32_t FMC_ReadBandGap(void)
{
    FMC->ISPCMD = FMC_ISPCMD_READ_UID;            /* Set ISP Command Code */
    FMC->ISPADDR = 0x70u;                         /* Must keep 0x70 when read Band-Gap */
    FMC->ISPTRG = FMC_ISPTRG_ISPGO_Msk;           /* Trigger to start ISP procedure */
#if ISBEN
    __ISB();
#endif                                            /* To make sure ISP/CPU be Synchronized */
    while(FMC->ISPTRG & FMC_ISPTRG_ISPGO_Msk) {}  /* Waiting for ISP Done */

    return FMC->ISPDAT & 0xFFF;
}

int32_t getBuiltInBandGap(void)
{
    int32_t res = 0;
    SYS_UnlockReg();
    FMC_Open();
    res = FMC_ReadBandGap();
    FMC_Close();
    SYS_LockReg();

    return res;
}

uint32_t GetAVDDCodeByADC(void)
{
    // uint32_t u32Count = 0;
    uint32_t u32Sum = 0;
    // uint32_t u32Data = 0;
    static uint8_t init_flag = 1;

    // /* Power on ADC */
    SYS_ResetModule(ADC_RST);
    ADC_POWER_ON(ADC);
    // CLK_SysTickDelay(10000);

    /* Set input mode as single-end, Single mode, and select channel 29 (band-gap voltage) */
    ADC_Open(ADC, ADC_ADCR_DIFFEN_SINGLE_END, ADC_ADCR_ADMD_SINGLE, BIT29);


