released/M031BSP_ADC_Bandgap_MultiCH_PDMA/SampleCode/Template/main.c
    /*
        ADC clock source -> HIRC  = 48 MHz
        ADC clock divider          = 32
        ADC clock                  = 48 MHz / 32 = 1.5 MHz
        ADC extended sampling time = 71
        ADC conversion time = 17 + ADC extended sampling time = 88
        ADC conversion rate = 1.5 MHz / 88 = 17.045 ksps
    */

    ADC_SetExtendSampleTime(ADC, 0, 71);

    /* Clear conversion finish flag */
    ADC_CLR_INT_FLAG(ADC, ADC_ADF_INT);

    u32Sum = 0;

    #if 1   // moving average

    if (init_flag)
    {
        init_flag = 0;
	    u32Sum = Filter_MovingAverage(State_average);
    }
    else
    {        
	    u32Sum = Filter_MovingAverage(State_moving);
    }

    return ( (uint16_t) u32Sum);

    #else   // simple average
    /* sample times are according to VREF_SAMPLE_POWER definition */
    for(u32Count = 0; u32Count < ADC_SAMPLE_COUNT; u32Count++)
    {
        /* Delay for band-gap voltage stability */
        CLK_SysTickDelay(100);

        /* Start A/D conversion */
        ADC_START_CONV(ADC);

        u32Data = 0;

        /* Wait conversion done */
        while(!ADC_GET_INT_FLAG(ADC, ADC_ADF_INT));

        /* Clear the A/D interrupt flag for safe */
        ADC_CLR_INT_FLAG(ADC, ADC_ADF_INT);

        // __WFI();
        // while(ADC_IS_DATA_VALID(ADC, 29) == 0);     

        /* Get the conversion result */
        u32Data = ADC_GET_CONVERSION_DATA(ADC, 29);
        /* Sum each conversion data */
        u32Sum += u32Data;
    }

    /* Disable ADC */
    // ADC_POWER_DOWN(ADC);

    /* Return the average of VREF_SAMPLE_POWER samples */
    return (u32Sum >> ADC_SAMPLE_POWER);
    #endif
}

uint32_t GetAVDDVoltage(void)
{
    uint32_t  u32ConversionResult;
    uint32_t u32MvAVDD;
    uint32_t BuiltInData = 0;

    u32ConversionResult = GetAVDDCodeByADC();
    BuiltInData = getBuiltInBandGap();

    u32MvAVDD = (3072*BuiltInData) / u32ConversionResult;

    // printf("Conversion result: 0x%X\n", u32ConversionResult);

    return (uint32_t)u32MvAVDD;
}


uint16_t ADC_InitChannel(uint8_t ch)
{
    uint16_t tmp = 0;
  	volatile uint32_t sum = 0;
    uint16_t u16adc_convert_target = 0;
	volatile uint16_t adc_value = 0;

	u16adc_convert_target = (ADC_MIN_TARGET*ADC_RESOLUTION/AVdd);

    #if 0   // polling
    ADC_Open(ADC, ADC_ADCR_DIFFEN_SINGLE_END, ADC_ADCR_ADMD_SINGLE_CYCLE, 0x1 << ch);

    for ( tmp = ADC_SAMPLE_DROP ; tmp < (ADCTotalLength) ; tmp++)
    {  		
        /* Clear the A/D interrupt flag for safe */
        ADC_CLR_INT_FLAG(ADC, ADC_ADF_INT);

        /* Start A/D conversion */
        ADC_START_CONV(ADC);

        /* Wait conversion done */
        while(!ADC_GET_INT_FLAG(ADC, ADC_ADF_INT));

        /* Clear the A/D interrupt flag for safe */
        ADC_CLR_INT_FLAG(ADC, ADC_ADF_INT);        		
        sum += ADC_GET_CONVERSION_DATA(ADC, ch);							
    }
    sum = sum >> ADC_SAMPLE_POWER;
    adc_value = sum;


    #else   // PDMA
    FLAG_PROJ_PDMA_ADC = 0;
	
    /* reload PDMA configuration for next transmission */
    ReloadPDMA();	

    /* Select ADC input channel */
    ADC_SET_INPUT_CHANNEL(ADC, 0x1 << ch);

    /* ADC enable PDMA transfer */
    ADC_ENABLE_PDMA(ADC);

    /* Start ADC conversion */
    ADC_START_CONV(ADC);

    while(!FLAG_PROJ_PDMA_ADC);
    FLAG_PROJ_PDMA_ADC = 0;
    ADC_STOP_CONV(ADC);
    ADC_DISABLE_PDMA(ADC); 

    #if 0   // drop first 4
    for ( tmp = ADC_SAMPLE_DROP ; tmp < (ADCTotalLength) ; tmp++)
    {        					
        sum += g_iConversionData[tmp];							
    }
    #else   // sorting and drop first 2 and last 2
    Sort_tab( (uint16_t*) g_iConversionData,ADCTotalLength);
    for (tmp = ADC_SAMPLE_DROP/2; tmp < ADCTotalLength - ADC_SAMPLE_DROP/2; tmp++)
    {
        sum += g_iConversionData[tmp];
    }
    #endif

    sum = sum >> ADC_SAMPLE_POWER;
    adc_value = sum;
    #endif

	adc_value = (adc_value <= u16adc_convert_target) ? (u16adc_convert_target) : (adc_value); 
	adc_value = (adc_value >= ADC_RESOLUTION) ? (ADC_RESOLUTION) : (adc_value); 


    return (uint16_t)(adc_value);
}

uint16_t ADC_To_Voltage(uint16_t adc_value)
{
	uint16_t volt = 0;

//	volt = (uint16_t) (AVdd*adc_value)/ADC_DIGITAL_SCALE();
	volt = (float) (AVdd*adc_value)/ADC_DIGITAL_SCALE();
	
	#if 0   //debug
    printf(",0x%4X(%5d,%5d),",adc_value,adc_value , volt);

	#endif

	return volt;	
}

void ADC_Process(void)
{
    ADC_DataArray[ADC0_CH0]     = ADC_InitChannel(ADC0_CH0);
    ADC_DataArray[ADC0_CH1]     = ADC_InitChannel(ADC0_CH1);
    ADC_DataArray[ADC0_CH2]     = ADC_InitChannel(ADC0_CH2);
    ADC_DataArray[ADC0_CH3]     = ADC_InitChannel(ADC0_CH3);
    ADC_DataArray[ADC0_CH4]     = ADC_InitChannel(ADC0_CH4);
    ADC_DataArray[ADC0_CH5]     = ADC_InitChannel(ADC0_CH5);
    ADC_DataArray[ADC0_CH6]     = ADC_InitChannel(ADC0_CH6);  
    ADC_DataArray[ADC0_CH7]     = ADC_InitChannel(ADC0_CH7);
    ADC_DataArray[ADC0_CH8]     = ADC_InitChannel(ADC0_CH8);
    ADC_DataArray[ADC0_CH9]     = ADC_InitChannel(ADC0_CH9);
    ADC_DataArray[ADC0_CH15]    = ADC_InitChannel(ADC0_CH15);
}

void ADC_ConvertInit(void)
{

    /* Power on ADC module */
    SYS_ResetModule(ADC_RST);
    ADC_POWER_ON(ADC);
    // CLK_SysTickDelay(10000);

    /* Set input mode as single-end, and Single mode*/
    ADC_Open(ADC, ADC_ADCR_DIFFEN_SINGLE_END, ADC_ADCR_ADMD_CONTINUOUS,(uint32_t) NULL);

    /*
        ADC clock source -> HIRC  = 48 MHz
        ADC clock divider          = 32
        ADC clock                  = 48 MHz / 32 = 1.5 MHz
        ADC extended sampling time = 0
        ADC conversion time = 17 + ADC extended sampling time = 17
        ADC conversion rate = 1.5 MHz / 17 = 88.235 ksps
    */

    /* Set extend sampling time based on external resistor value.*/
    ADC_SetExtendSampleTime(ADC,(uint32_t) NULL, 0);

}

void ADC_Init(void)
{
    AVdd = GetAVDDVoltage();
    // printf("AVDD Voltage: %dmV\r\n", AVdd);    

    // PDMA_Init();
    ADC_ConvertInit();

	ADC_Process();
    // PDMA_DeInit();
}

void regular_log(void)
{
    unsigned int res = 0;
    uint8_t i = 0;   

    #if 1   // debug ADC
    printf("AVdd :%4dmv, ",AVdd );
    printf("\r\n");

    for (i = 0 ; i < ADC_CH_NUM ; i++)
    {
        res = ADC_To_Voltage(ADC_DataArray[i]);
        printf("%2d:%4dmv[0x%4X],",i , res , ADC_DataArray[i]);

        if ((i+1)%4 ==0)
        {
            printf("\r\n");
        } 
    }

    printf("\r\n");    
    #endif 

